Revit 2024 API
Camera.HorizontalOffset Property
 Horizontal offset of the camera's view center from target, measured at target distance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double HorizontalOffset { get; set; }
Visual Basic
Public Property HorizontalOffset As Double
	Get
	Set
Visual C++
public:
property double HorizontalOffset {
	double get ();
	void set (double value);
}
See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace